Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/svd/PIC32CM1216LS00032.svd
            <register>
               <name>ASYNCH</name>
               <description>External Interrupt Asynchronous Mode</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ASYNCH0</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH0Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH1</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH1Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH2</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH2Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH3</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH3Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH4</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH4Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH5</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH5Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH6</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH6Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH7</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH7Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
