Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/svd/PIC32CM1216LS00032.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>OSC32KCTRL</name>
         <version>U22464.0.0</version>
         <description>32k Oscillators Control</description>
         <baseAddress>0x40001400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detector</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Power and Clocks Status</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detector</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSW</name>
                     <description>XOSC32K Clock switch</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULP32KSW</name>
                     <description>OSCULP32K Clock Switch</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCCTRL</name>
               <description>RTC Clock Selection</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RTCSELSelect</name>
                        <enumeratedValue>
                           <name>ULP1K</name>
                           <description>1.024kHz from 32kHz internal ULP oscillator</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ULP32K</name>
                           <description>32.768kHz from 32kHz internal ULP oscillator</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC1K</name>
                           <description>1.024kHz from 32.768kHz external crystal oscillator</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>32.768kHz from 32.768kHz external crystal oscillator</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSC32K</name>
               <description>32kHz External Crystal Oscillator (XOSC32K) Control</description>
               <addressOffset>0x14</addressOffset>
               <size>16</size>
               <resetValue>0x0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN32K</name>
                     <description>32kHz Output Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN1K</name>
                     <description>1kHz Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Oscillator Start-Up Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>CYCLE2048</name>
                           <description>62.5 ms</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4096</name>
                           <description>125 ms</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16384</name>
                           <description>500 ms</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32768</name>
                           <description>1000 ms</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE65536</name>
                           <description>2000 ms</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE131072</name>
                           <description>4000 ms</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE262144</name>
                           <description>8000 ms</description>
                           <value>6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFDCTRL</name>
               <description>Clock Failure Detector Control</description>
               <addressOffset>0x16</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CFDEN</name>
                     <description>Clock Failure Detector Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWBACK</name>
                     <description>Clock Switch Back Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDPRESC</name>
                     <description>Clock Failure Detector Prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x17</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CFDEO</name>
                     <description>Clock Failure Detector Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCULP32K</name>
               <description>32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ULP32KSW</name>
                     <description>OSCULP32K Clock Switch Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
