Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/svd/PIC32CM1216LS00032.svd
               <register>
                  <name>CTRLB</name>
                  <description>SPIM Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CHSIZE</name>
                        <description>Character Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>CHSIZESelect</name>
                           <enumeratedValue>
                              <name>8_BIT</name>
                              <description>8 bits</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>9_BIT</name>
                              <description>9 bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PLOADEN</name>
                        <description>Data Preload Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSDE</name>
                        <description>Slave Select Low Detect Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>SSDESelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>SS low detector is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>SS low detector is enabled</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSSEN</name>
                        <description>Master Slave Select Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSSENSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Hardware SS control is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>Hardware SS control is enabled</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>AMODE</name>
                        <description>Address Mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>AMODESelect</name>
                           <enumeratedValue>
                              <name>MASK</name>
                              <description>ADDRMASK is used as a mask to the AADR register</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2ADDRS</name>
                              <description>The slave responds to the two unique addresses in ADDR and ADDRMASK</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RANGE</name>
                              <description>The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXEN</name>
                        <description>Receiver Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOCLR</name>
                        <description>FIFO Clear</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>FIFOCLRSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TXFIFO</name>
                              <description>Clear TX FIFO</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RXFIFO</name>
                              <description>Clear RX FIFO</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BOTH</name>
                              <description>Clear both TX and RF FIFOs</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLC</name>
                  <description>SPIM Control C</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ICSPACE</name>
                        <description>Inter-Character Spacing</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>DATA32B</name>
                        <description>Data 32 Bit</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOEN</name>
                        <description>FIFO Enable</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXTRHOLD</name>
                        <description>Receive FIFO Threshold</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>RXTRHOLDSelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Interrupt and DMA triggers are generated when DATA is present in the FIFO</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Interrupt and DMA triggers are generated when FIFO is half-full</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FULL</name>
                              <description>Interrupt and DMA triggers are generated when FIFO is full</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXTRHOLD</name>
                        <description>Transmit FIFO Threshold</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TXTRHOLDSelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Interrupt and DMA triggers are generated as long as the FIFO is not full</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Interrupt and DMA triggers are generated when half FIFO space is free</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EMPTY</name>
                              <description>Interrupt and DMA triggers are generated as long as the FIFO is empty</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>SPIM Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>SPIM Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>SPIM Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>SPIM Interrupt Flag Status and Clear</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>SPIM Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BUFOVF</name>
                        <description>Buffer Overflow</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LENERR</name>
                        <description>Transaction Length Error</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>SPIM Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LENGTH</name>
                        <description>LENGTH Synchronization Busy</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LENGTH</name>
                  <description>SPIM Length</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LEN</name>
                        <description>Data Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>LENEN</name>
                        <description>Data Length Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR</name>
                  <description>SPIM Address</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>ADDRMASK</name>
                        <description>Address Mask</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>SPIM Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>SPIM Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOSPACE</name>
                  <description>SPIM FIFO Space</description>
                  <addressOffset>0x34</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>TXSPACE</name>
                        <description>Tx FIFO Empty Space</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>RXSPACE</name>
                        <description>Rx FIFO Filled Space</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOPTR</name>
                  <description>SPIM FIFO CPU Pointers</description>
                  <addressOffset>0x36</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>CPUWRPTR</name>
                        <description>CPU FIFO Write Pointer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPURDPTR</name>
                        <description>CPU FIFO Read Pointer</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
